### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # azurerm_key_vault_access_policy.func_profile_kv_common will be created
  + resource "azurerm_key_vault_access_policy" "func_profile_kv_common" {
      + id                 = (known after apply)
      + key_vault_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.KeyVault/vaults/io-p-kv-common"
      + object_id          = "fff812bb-3a9e-40fd-8e6c-dcfa6b94b51d"
      + secret_permissions = [
          + "Get",
        ]
      + tenant_id          = "7788edaf-0346-4068-9d79-c868aed15b3d"
    }

  # azurerm_key_vault_access_policy.func_profile_staging_kv_common will be created
  + resource "azurerm_key_vault_access_policy" "func_profile_staging_kv_common" {
      + id                 = (known after apply)
      + key_vault_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.KeyVault/vaults/io-p-kv-common"
      + object_id          = "e3aa2d9e-3eda-406b-a064-f01849edf3cf"
      + secret_permissions = [
          + "Get",
        ]
      + tenant_id          = "7788edaf-0346-4068-9d79-c868aed15b3d"
    }

  # module.pub_session_manager_internal_staging.module.service_bus.azurerm_role_assignment.topics["/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ServiceBus/namespaces/io-p-itn-platform-sbns-01|io-auth-sessions-topic|writer"] will be created
  + resource "azurerm_role_assignment" "topics" {
      + condition_version                = (known after apply)
      + description                      = "This role allows managing the given topic"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "9f0a1505-260e-46fc-a130-fea5519f7666"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Service Bus Data Sender"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ServiceBus/namespaces/io-p-itn-platform-sbns-01/topics/io-auth-sessions-topic"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.sub_io_prof_async_staging.module.service_bus.azurerm_role_assignment.subscriptions["/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ServiceBus/namespaces/io-p-itn-platform-sbns-01|io-auth-sessions-topic|io-session-notifications-sub|reader"] will be created
  + resource "azurerm_role_assignment" "subscriptions" {
      + condition_version                = (known after apply)
      + description                      = "This role allows receiving messages from the given subscription"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "6af06a8e-d9b4-458a-a02f-eee8bd87081e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Service Bus Data Receiver"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ServiceBus/namespaces/io-p-itn-platform-sbns-01/topics/io-auth-sessions-topic/subscriptions/io-session-notifications-sub"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```

</details>
